<%@ Page Title="" Language="C#" MasterPageFile="~/MasterPage.Master" AutoEventWireup="true" CodeBehind="ChrisMartin.aspx.cs" Inherits="FinalProject.ChrisMartin" %>
<asp:Content ID="Content1" ContentPlaceHolderID="head" runat="server">
    <style>
        body {
           color: white
        }
    </style>
</asp:Content>
<asp:Content ID="Content2" ContentPlaceHolderID="ContentPlaceHolder1" runat="server">
    <h2>ראשית חיוו</h2>
    <p>
        מרטין נולד וגדל באקסטר, במחוז דבון שבאנגליה. הוא הבן הבכור מתוך חמישה אחים. אביו, אנטוני מרטין, הוא רואה חשבון בדימוס, ואמו, אליסון מרטין, היא מורה למוזיקה. מרטין החל את השכלתו בבית הספר "הילטון", שמטרתו להכין תלמידים ללימודים באוניברסיטאות היוקרתיות, ומשם עבר לבית הספר "קתדרלת אקסטר". בבית הספר הנ"ל הקים מרטין את להקתו הראשונה, "The Rocking Honkies" (אין לשם פירוש מדויק), יחד עם ניק רפטון ואיאן גרונואו. לאחר "קתדרלת אקסטר", מרטין עבר לבית הספר "שרבורן", בית ספר פרטי לבנים במחוז דורסט שבמערב אנגליה. בשרבורן מרטין פגש את פיל הארווי, מנהל העתיד של להקת קולדפליי. מרטין המשיך את לימודיו בקולג' האוניברסיטאי של לונדון והתגורר במגורי הסטודנטים, שם קרא מחקרים על העולם העתיק, וסיים בהצטיינות בכיתה ללימודי יוונית ולטינית. באוניברסיטה מרטין פגש את חבריו העתידיים ללהקה, ג'ון באקלנד, גאי ברימן, וויל צ'מפיון.    
    </p>
    <h2>קריירת סולו</h2>
    <p>
        כאמן סולו, מרטין כתב שירים למספר להקות, ביניהן Embrace (השיר "Gravity"), והזמרת ג'מליה ("See It in a Boy's Eyes", שנכתב יחד עם המפיק של קולדפליי, ריק סימפסון). בנוסף, מרטין שיתף פעולה עם רון סקסמית', Faultline, פרויקט The Streets, ואיאן מק'קולוך. מרטין השתתף בהפקת השיר "Do They Know It's Christmas?" עם להקת באנד אייד, בסוף 2004. בשנת 2005, מרטין חבר לזמרת נלי פורטדו בשיר "All Good Things - Come to an End" ("כל הדברים הטובים - באים לסופם"), לטובת אלבומה של פורטדו, Loose, שיצא שנה לאחר מכן. הופצה שמועה לגבי היותם זוג לאחר שהופיעו יחד בפסטיבל גלסטונברי ב-2002. פורטדו התלוצצה על הסיטואציה, ואמרה ש"כן, הוא חבר שלי - הוא פשוט עדיין לא יודע את זה."

מרטין יושב ליד הפסנתר שלו, במהלך הופעה בשנת 2005.
משיכתו של מרטין להיפ-הופ נחשפה באמצע שנת 2006, כששיתף פעולה עם הראפר ג'יי זי לטובת אלבום הקאמבק של הראפר, Kingdom Come, לאחר שנפגשו מוקדם יותר באותה השנה. מרטין שילב מספר אקורדים יחד לשיר שידוע כ"Beach Chair", ושלח אותם לג'יי זי, שגייס את עזרתו של מפיק ההיפ-הופ ד"ר דרה, לעריכת השיר (בניגוד לשמועות לא נכונות, שהמפיק של קולדפליי, ריק סימפסון, עשה זאת). השיר בוצע בהופעה חייה על ידי השניים ב-27 בספטמבר 2006, כחלק מסיבוב ההופעות של ג'יי זי באירופה, באולם המופעים אלברט הול. בשנת 2007, מרטין הופיע בקטע הנקרא "Part of the Plan", שפורסם כחלק מאלבום הסולו של האמן סויז ביטס, "One Man Band Man". מרטין עבד כזמר סולו עם קניה וסט, והשניים חלקו ג'אם סשן מאולתר בשנת 2006, בקונצרט שנערך באולפני אבי רוד. במסגרת העבודה של השניים, מרטין הופיע בפזמון של השיר "Homecoming", מתוך אלבומו של וסט, Graduation.
    </p>
</asp:Content>
